
import streamlit as st

st.set_page_config(page_title="ADI 계산기", page_icon="🧪")

drinks = {
    "갈배 사이다 제로": {"아세설팜칼륨": 53, "수크랄로스": 64},
    "나랑드사이다 제로": {"아세설팜칼륨": 31, "수크랄로스": 59},
    "노브랜드 콜라 제로": {"아세설팜칼륨": 57, "수크랄로스": 71},
    "닥터페퍼 제로": {"아세설팜칼륨": 39, "수크랄로스": 89},
    "맥콜 제로": {"아세설팜칼륨": 20, "수크랄로스": 68},
    "미에로화이바 스파클링 제로": {"아세설팜칼륨": 70, "수크랄로스": 49},
    "스프라이트 제로": {"아세설팜칼륨": 57, "수크랄로스": 96},
    "코카콜라 제로": {"아세설팜칼륨": 36, "수크랄로스": 82},
    "펩시 제로슈거 라임": {
        "아세설팜칼륨": 46,
        "수크랄로스": 60,
        "아스파탐": 99
    },
    "환타 제로 파인애플": {"아세설팜칼륨": 43, "수크랄로스": 71}
}

ADI = {
    "아세설팜칼륨": 15,
    "수크랄로스": 15,
    "아스파탐": 40
}

st.title("ADI 계산기")

st.write("ADI 계산기입니다. 어떤 음료를 마실 것인지 선택해주세요.")
st.caption("설명: 처음 사용하는 경우 아래 설명을 먼저 읽어주세요.")

with st.expander("0번 설명 보기"):
    st.write("""
    (번호를 입력하세요)

    1: 갈배 사이다 제로
    2: 나랑드사이다 제로
    3: 노브랜드 콜라 제로
    4: 닥터페퍼 제로
    5: 맥콜 제로
    6: 미에로화이바 스파클링 제로
    7: 스프라이트 제로
    8: 코카콜라 제로
    9: 펩시 제로슈거 라임
    10: 환타 제로 파인애플

    ADI(허용 일일 섭취량)는 사람이 특정 물질을 매일 평생 섭취해도
    건강상 유해한 영향이 나타나지 않을 것으로 판단되는 1일 섭취량을 의미합니다.

    하지만 어디까지나 '건강상 유해한 영향'이 나타나지 않는 것이기 때문에
    계산된 양만큼 마셔도 된다는 것이 아닙니다.

    언제나 제로음료 과다섭취는 좋지 않을 수 있습니다.

    그리고 다른 음식으로 인공감미료를 섭취하지 않았을 때의 최대 섭취량입니다.
    """)

drink = st.selectbox(
    "어떤 음료를 선택하시겠습니까?",
    list(drinks.keys())
)

weight = st.number_input(
    "체중을 입력해주세요(단위 제외, 숫자만, 양수로, Kg 기준)",
    min_value=1,
    step=1,
    value=30
)

if st.button("계산하기"):

    K = drinks[drink].get("아세설팜칼륨", 0)
    S = drinks[drink].get("수크랄로스", 0)
    A = drinks[drink].get("아스파탐", 0)

    b = weight

    KA = ADI["아세설팜칼륨"] * b
    SA = ADI["수크랄로스"] * b
    AA = ADI["아스파탐"] * b

    KP = KA // K if K else float("inf")
    SP = SA // S if S else float("inf")
    AP = AA // A if A else float("inf")

    result = min(KP, SP, AP)

    st.write(f"하루 최대 섭취 가능 캔 수: {result}캔입니다.")
    st.warning(
        "어디까지나 '유해하지 않은' 한도량이라는 것을 명심하세요!"
    )
